project1_server/app/controllers/api/v1/menu_items_controller.rb

  def index
    # Public access

    @menu_items = MenuItem.where :menu_id => params[:menu_id]
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = $1 LIMIT $2  [["menu_id", 2], ["LIMIT", 1]]

  def create
    # Require token access
    if current_user
      @menu_item = MenuItem.create(menu_params)
---
INSERT INTO "menu_items" ("name", "description", "is_avail", "price", "menu_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"