project1_server/app/controllers/api/v1/menus_controller.rb

SELECT  "menus".* FROM "menus" WHERE "menus"."restaurant_id" = $1 LIMIT $2  [["restaurant_id", 5], ["LIMIT", 1]]
---
  def index
    # Public access
    @menus = Menu.find_by :restaurant_id => params[:restaurant_id]

INSERT INTO "menus" ("name", "description", "is_avail", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # Require token access
    if current_user
      @menu = Menu.create(menu_params)

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_menu
      @menu = Menu.find(params[:id])