project1_server/app/controllers/api/v1/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    # Public access
    @restaurants = Restaurant.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "restaurants" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-04-02 01:15:32.099446"], ["updated_at", "2018-04-02 01:15:32.099446"], ["user_id", "3"]]
---
  def create
    # Require token access
    if current_user
      user = User.find(current_user)
      @restaurant = user.restaurants.create!(restaurant_params)

UPDATE "restaurants" SET "profile_image" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["profile_image", "http://fillmurray.com/200/300"], ["updated_at", "2018-04-02 08:37:22.591569"], ["id", 5]]
---
  def update
    # Require token access
    @restaurant.update restaurant_params

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "menus".* FROM "menus" WHERE "menus"."restaurant_id" = $1  [["restaurant_id", 14]]
---
  def menus

    restaurant = Restaurant.find(params[:id])
    @menus = restaurant.menus.all

DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 24]]
---
  def destroy
    # Require token access
    @restaurant.destroy