project1_server/app/controllers/api/v1/users_controller.rb

  def restaurants
    user = User.find(params[:id])
    @restaurants = user.restaurants.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = $1  [["user_id", "2"]]

  def create
    @user = User.create!(user_params)
---
INSERT INTO "users" ("role_id", "created_at", "updated_at", "password_digest", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"